{
    "motd": "This build introduces the public/beta release of webhook-based push notifications for LunaSea! Push notifications are supported on all 3 platforms (Android, iOS, and macOS) and are completely free. Want push notifications from your modules sent to LunaSea? Head to the Settings' notification page to get started! \n\nThis build also includes some other minor changes including an option to set the Radarr queue page size, refreshing Sonarr's queue will now also refresh the download client status, and it is now easier to dismiss bottom sheets by swiping down.",
    "new": [
        {
            "module": "Notifications",
            "changes": [
                "Release webhook-based notifications to all beta users"
            ]
        },
        {
            "module": "Settings",
            "changes": [
                "Added localization configuration page",
                "Added setup page for webhook notifications",
                "(Radarr) Added option to set queue page size"
            ]
        },
        {
            "module": "Sonarr",
            "changes": [
                "(Queue) Refreshing the queue will now also refresh the monitored downloads from the clients"
            ]
        }
    ],
    "tweaks": [
        {
            "module": "Notifications",
            "changes": [
                "(Radarr) Now opens the queue on \"Grab\" notifications",
                "(Sonarr) Now opens the queue on \"Grab\" notifications"
            ]
        },
        {
            "module": "Radarr",
            "changes": [
                "(Queue) Increased default queue page size to 50 items"
            ]
        },
        {
            "module": "Settings",
            "changes": [
                "(Account) Removed the ability to pull user ID or device ID from help dialog"
            ]
        }
    ],
    "fixes": [
        {
            "module": "Bottom Sheet",
            "changes": [
                "Reduce swipe down to dismiss threshold to 10% of height"
            ]
        },
        {
            "module": "Firebase",
            "changes": [
                "Add platform check to disable Firebase on incompatible platforms"
            ]
        },
        {
            "module": "Flutter",
            "changes": [
                "Update packages"
            ]
        },
        {
            "module": "Radarr",
            "changes": [
                "(File Details) Show a dash when no information is available for a table entry"
            ]
        },
        {
            "module": "Sonarr",
            "changes": [
                "(Queue) Ensure the trailing icon on queue entries is centered vertically"
            ]
        },
        {
            "module": "UI/UX",
            "changes": [
                "Add padding around \"No Tags Found\" message within tag selection dialogs",
                "Improve consistency of module-level settings dialog"
            ]
        }
    ],
    "platform": [
        {
            "module": "Android",
            "changes": [
                "(new) Attach module headers to requests when viewing the web GUI"
            ]
        },
        {
            "module": "macOS",
            "changes": [
                "(fix) Sharesheet would not appear on iPadOS devices"
            ]
        },
        {
            "module": "macOS",
            "changes": [
                "(fix) Sharesheet now supports macOS builds"
            ]
        }
    ]
}
