{
    "motd": "This build introduces some big things including some big UI changes and features!\n\nFirst is a whole new design for buttons, which are more uniform across the application, with major actions now being stickied to the bottom navigation area. Scroll-back by tapping the AppBar is now available across the entire UI, and also the completion of removing all old UI elements being used, ensuring that the UI feels more uniform between modules.\n\nLastly, this build introduces support for a brand new feature, manual import support for Radarr! You can trigger either a quick or interactive import with full support for browsing the filesystem and selecting the movie, quality profile, and languages.\n\nThere are a lot more changes that you can read about below!",
    "new": [
        {
            "module": "Radarr/\nCatalogue",
            "changes": [
                "Ability to sort by in cinema, physical release, and digital release dates"
            ]
        },
        {
            "module": "Radarr/\nDetails",
            "changes": [
                "Show the monitor state of the movie in the overview table"
            ]
        },
        {
            "module": "Radarr/\nImport",
            "changes": [
                "Ability to manually import content from the filesystem"
            ]
        },
        {
            "module": "Sonarr/\nAdd",
            "changes": [
                "View a series' TheTVDB page by long-pressing the tile in the search list"
            ]
        },
        {
            "module": "Sonarr/\nCatalogue",
            "changes": [
                "If no series is found in the search query, given an option to search to add the series"
            ]
        },
        {
            "module": "System/\nResources",
            "changes": [
                "Added link to system status page for LunaSea hosted services"
            ]
        },
        {
            "module": "Tautulli/\nWebhooks",
            "changes": [
                "Support for deep-linking to content through notifications"
            ]
        },
        {
            "module": "UI/UX",
            "changes": [
                "All lists now have scroll-back support by tapping the AppBar"
            ]
        }
    ],
    "tweaks": [
        {
            "module": "Dashboard",
            "changes": [
                "Removed month header from calendar",
                "Disable calendar days outside of the past and future date range"
            ]
        },
        {
            "module": "Lidarr/\nArtist",
            "changes": [
                "Overview is now displayed as a table, to match Radarr and Sonarr"
            ]
        },
        {
            "module": "NZBGet/\nStatus",
            "changes": [
                "Status and statistics are now shown in a table"
            ]
        },
        {
            "module": "SABnzbd/\nStatus",
            "changes": [
                "Status and statistics are now shown in a table"
            ]
        },
        {
            "module": "UI/UX",
            "changes": [
                "Minor tweaks to the colour palette",
                "Unify the design and size of all action buttons",
                "Sticky primary action buttons to the bottom navigation bar area",
                "Unified the design of all expandable cards in their expanded state",
                "Bottom modal sheets lists will now shrink wrap to match content height",
                "All ListViews will now dismiss the keyboard on scroll gestures",
                "Navigation bar buttons now only highlight the icon",
                "Opening the drawer will now ensure that the keyboard gets dismissed",
                "Removed all deprecated UI elements and usages"
            ]
        }
    ],
    "fixes": [
        {
            "module": "Backup & Restore",
            "changes": [
                "Indexers would not get restored with backups"
            ]
        },
        {
            "module": "Dashboard",
            "changes": [
                "Radarr releases were not considering the digital release date"
            ]
        },
        {
            "module": "Dialogs",
            "changes": [
                "Checkbox tiles were padded too aggressively in the X-axis"
            ]
        },
        {
            "module": "Networking",
            "changes": [
                "Headers would not get attached in some networking configurations"
            ]
        },
        {
            "module": "NZBGet/\nQueue",
            "changes": [
                "Queue would not refresh in some cases when switching profiles"
            ]
        },
        {
            "module": "Radarr/\nCatalogue",
            "changes": [
                "\"Search For...\" would be shown when there were no results and the query was empty"
            ]
        },
        {
            "module": "Radarr/\nDetails",
            "changes": [
                "The overview table would not update after editing a movie"
            ]
        },
        {
            "module": "SABnzbd\n/Queue",
            "changes": [
                "Queue would not refresh in some cases when switching profiles"
            ]
        },
        {
            "module": "Snackbar/\nErrors",
            "changes": [
                "All error snackbars will now have a button to view the error"
            ]
        },
        {
            "module": "Sonarr/\nAdd",
            "changes": [
                "Series type would not be set correctly when adding a new series"
            ]
        },
        {
            "module": "Tautulli/\nActivity",
            "changes": [
                "Activity header included some incorrectly localized strings"
            ]
        },
        {
            "module": "UI/UX",
            "changes": [
                "Remove all uses of the deprecated snackbar",
                "Some elements were using the system colours instead of the LunaSea colours"
            ]
        },
        {
            "module": "Webhooks",
            "changes": [
                "Push the module's home route when receiving malformed data blocks from webhooks"
            ]
        }
    ]
}
