{
    "motd": "This build introduces support for the discover feature in Radarr! Similar to the web GUI, it will build out a list of movies to add based on your import lists and Radarr suggestions (which can be disabled in the settings).\n\nThis build also fixes many issues with the current nightly builds, including fixing the ability to add new movies.\n\nA feature that was removed with this build is the ability to sort/categorize drawer entries. In the future, the drawer will get more customizable options to replace what this option offered.\n\nAnd lastly in this build is a minor UI change, changing \"Home\" to \"Dashboard\" to prepare for a much more powerful dashboard in the future.",
    "version": "5.0.0",
    "build": "50000002",
    "new": [
        {
            "module": "Dashboard",
            "changes": [
                "\"Home\" has been renamed to \"Dashboard\""
            ]
        },
        {
            "module": "Radarr/Catalogue",
            "changes": [
                "If no movie is found in the search query, given an option to search to add the movie"
            ]
        },
        {
            "module": "Radarr/Discover",
            "changes": [
                "Add the ability to discover movies from your import lists & Radarr recommendations"
            ]
        },
        {
            "module": "Radarr/Releases",
            "changes": [
                "Ability to set sorting direction, category, and filtering method"
            ]
        },
        {
            "module": "Settings/Radarr",
            "changes": [
                "Ability to toggle on or off Radarr suggestions in the discover page"
            ]
        }
    ],
    "tweaks": [
        {
            "module": "Drawer",
            "changes": [
                "Removed the option to use categories/folders in the drawer"
            ]
        },
        {
            "module": "Settings/Config",
            "changes": [
                "Add pages within modules for cleaner isolation and easier expansion for future configuration options"
            ]
        },
        {
            "module": "Settings/Profiles",
            "changes": [
                "Renaming a profile now checks for an existing profile with the same name within the prompt",
                "Adding a profile now checks for an existing profile with the same name within the prompt",
                "The delete profile prompt now hides the currently enabled profile, and shows a snackbar if only one profile exists"
            ]
        },
        {
            "module": "Settings/Wake on LAN",
            "changes": [
                "Allow clearing the broadcast and MAC addresses to empty values"
            ]
        }
    ],
    "fixes": [
        {
            "module": "Radarr",
            "changes": [
                "Support for Radarr v3.1.0+ (nightly builds)"
            ]
        },
        {
            "module": "Radarr/Add",
            "changes": [
                "Instantly show a movie as addable again if removed right after adding it"
            ]
        },
        {
            "module": "Radarr/Cast",
            "changes": [
                "If a job or character name is empty, show a dash instead of an empty space"
            ]
        },
        {
            "module": "Radarr/Catalogue",
            "changes": [
                "Instantly remove the movie tile when removing a movie"
            ]
        },
        {
            "module": "Radarr/Edit",
            "changes": [
                "Padding around the \"Update Movie\" button was incorrect"
            ]
        },
        {
            "module": "Toasts",
            "changes": [
                "In some cases, the error was not being passed through to the error viewer"
            ]
        },
        {
            "module": "UI/UX",
            "changes": [
                "Upstream framework support for basic mouse/trackpad highlight and scrolling support",
                "Tapping the AppBar to scroll back in a nested route would scroll back the parent route as well",
                "Use the recommended safe area padding at the bottom of lists for fullscreen devices"
            ]
        }
    ]
}