{
    "motd": "This build offers some additional quality-of-life changes when adding a new series or movie, as now the tags you have set will be stored in the database! This build also now includes Trakt links on the overview for series and movies.\n\nFinally this build starts laying the groundwork to add full localization support to LunaSea. While additional languages have not yet been enabled, there is now a language option available in the settings to prepare. You can head to the Weblate page (found in Settings/Resources) to start helping localize LunaSea into your language!",
    "new": [
        {
            "module": "Radarr/\nAdd",
            "changes": [
                "Tags set when adding a movie are now stored in the database"
            ]
        },
        {
            "module": "Radarr/\nOverview",
            "changes": [
                "Add a link to the movie's Trakt page"
            ]
        },
        {
            "module": "Settings",
            "changes": [
                "Added a link to the Weblate localization page",
                "Added language switcher (currently only English, but preparing for localization support)"
            ]
        },
        {
            "module": "Sonarr/\nAdd",
            "changes": [
                "Tags set when adding a series are now stored in the database"
            ]
        },
        {
            "module": "Sonarr/\nOverview",
            "changes": [
                "Add a link to the series' Trakt page"
            ]
        }
    ],
    "tweaks": [
        {
            "module": "Branding/\nTMDB",
            "changes": [
                "Updated the logo to The Movie Database's new logo"
            ]
        },
        {
            "module": "Logging/\nTracking",
            "changes": [
                "Switched from Sentry to Firebase Crashlytics"
            ]
        },
        {
            "module": "Radarr/\nOverview",
            "changes": [
                "Move the links underneath the description to more closely match the layout of the web GUI"
            ]
        },
        {
            "module": "Search",
            "changes": [
                "Switched to a new package to parse XML responses"
            ]
        },
        {
            "module": "Settings/\nTracking",
            "changes": [
                "Adjusted the dialog and warn users that a reboot of the application is required to set tracking state"
            ]
        },
        {
            "module": "Sonarr/\nOverview",
            "changes": [
                "Move the links underneath the description to more closely match the layout of the web GUI"
            ]
        },
        {
            "module": "DateTime",
            "changes": [
                "Show \"Just Now\" when time differences are less than 10 seconds"
            ]
        }

    ],
    "fixes": [
        {
            "module": "Branding",
            "changes": [
                "Normalize size of all branded logos to have the same widths for consistency"
            ]
        },
        {
            "module": "Flutter",
            "changes": [
                "Fully move to Flutter v2",
                "Upgrade many packages to NNBD"
            ]
        },
        {
            "module": "Radarr/\nAdd",
            "changes": [
                "Grey screen could potentially be shown if no initial search query is passed to the route",
                "The navigation bar could jitter on first load in some cases"
            ]
        },
        {
            "module": "Radarr/\nCatalogue",
            "changes": [
                "The search query would not stay active between profile switches"
            ]
        },
        {
            "module": "Radarr/\nSorting",
            "changes": [
                "Changing the releases sorting/filtering method could throw an error"
            ]
        }
    ]
}
